cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-cask"
tap "drone/drone"

#core bits
#cask "spectacle"
brew "bash-completion"
brew "bash"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "gettext"
brew "git"
brew "libidn2"
brew "libunistring"
brew "libyaml"
brew "mas"
brew "openssl"
brew "pkg-config"
brew "postgresql"
brew "pre-commit"
brew "readline"
brew "redis"
brew "ripgrep"
brew "sqlite"
brew "ssh-copy-id"
brew "telnet"
brew "tree"
brew "unrar"
brew "vifm"
brew "wget"
brew "xz"
cask "ngrok"
cask "pgadmin4"

#coding tools / runtimes
brew "flake8"
brew "gdbm"
brew "icu4c"
brew "jq"
brew "node"
brew "oniguruma"
brew "pandoc"
brew "pcre2"
brew "pipenv"
brew "protovend"
brew "python"
brew "python@2"
brew "shellcheck"
brew "shimmer"
cask "atom"
cask "iterm2"
cask "postman"
cask "vagrant"
cask "visual-studio-code"

#config / cloud management
brew "ansible"
brew "awscli"
brew "azure-cli"
brew "docker-credential-helper-ecr"
brew "kubernetes-cli"
brew "stern"
brew "terraform"

#skyscanner
brew "artifactory-cli-login"
brew "aws-adfs-cli-login"
brew "drone"
brew "mshell-cut"
brew "mshell-tools"
brew "skyscanner-bundle"


#work safe apps
cask "alfred"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "slack"
cask "tunnelblick"
cask "vlc"

#home apps
#cask "steam"
#cask "transmission"
#cask "spotify-notifications"
#cask "skype"
#cask "private-internet-access"
#cask "dropbox"
#cask "calibre"

#mac app store stuff
mas "CalendarFree", id: 415181149
mas "Mactracker", id: 430255202
mas "Microsoft Remote Desktop", id: 715768417
mas "The Unarchiver", id: 425424353
mas "Kindle", id: 405399194
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835



