cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "drone/drone"
tap "adoptopenjdk/openjdk"

brew "python@3.9"
brew "ansible", link: false
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "brew-gem"
brew "cfn-lint", link: false
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "docker-credential-helper-ecr", link: false
brew "flake8"
brew "ruby"
brew "gem-cfn-nag"
brew "git"
brew "git-delta"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "kubernetes-cli"
brew "libidn2"
brew "mas"
brew "openjdk"
brew "maven"
brew "node"
brew "nvm"
brew "pandoc"
brew "pipenv"
brew "postgresql"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@2"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "ssh-copy-id", link: true
brew "stern"
brew "telnet"
brew "terraform"
brew "tree"
brew "unrar"
brew "vifm"
brew "wget"
cask "adoptopenjdk8"
cask "alfred", args: { appdir: "/Applications" }
cask "atom", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "java"
cask "ngrok", args: { appdir: "/Applications" }
cask "pgadmin4", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "powershell"
cask "tunnelblick", args: { appdir: "/Applications" }
cask "vagrant", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }


#mac app store stuff
mas "CalendarFree", id: 415181149
mas "Mactracker", id: 430255202
mas "Microsoft Remote Desktop", id: 715768417
mas "The Unarchiver", id: 425424353
mas "Kindle", id: 405399194
mas "Xcode", id: 497799835

#home apps
# cask "steam"
# cask "transmission"
# cask "spotify-notifications"
# cask "skype"
# cask "private-internet-access"
# cask "dropbox"
# cask "calibre"
# cask "handbrake", args: { appdir: "/Applications" }

