tap "adoptopenjdk/openjdk"
tap "azure/kubelogin"
tap "derailed/k9s"
tap "drone/drone"
tap "hashicorp/tap"
tap "hidetatz/tap"
tap "homebrew/bundle"
tap "jjuarez/tap-1"
tap "mplew-is/wrappers"
tap "robscott/tap"
tap "syncdk/yawsso"
tap "tilt-dev/tap"
brew "ansible"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.11"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "oniguruma"
brew "bat"
brew "brew-gem"
brew "caddy"
brew "fontconfig"
brew "glib"
brew "cfn-lint"
brew "cilium-cli"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "qemu"
brew "colima"
brew "coreutils"
brew "cowsay"
brew "csvkit"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "dive"
brew "docker"
brew "docker-credential-helper-ecr", link: false
brew "docutils"
brew "duff"
brew "findutils"
brew "flake8"
brew "unixodbc"
brew "freetds"
brew "node"
brew "fx"
brew "fzf"
brew "libavif"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "gitlab-runner"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gomplate"
brew "grep"
brew "hadolint"
brew "helm"
brew "helmfile"
brew "hexyl"
brew "htop"
brew "infracost"
brew "jenv"
brew "jnv"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kops"
brew "krb5"
brew "krew"
brew "kube-linter"
brew "kube-ps1"
brew "kubectx"
brew "kubespy"
brew "libfido2"
brew "logcli"
brew "mas"
brew "openjdk"
brew "maven"
brew "minikube"
brew "most"
brew "mysql"
brew "newrelic-cli"
brew "nghttp2"
brew "nvm"
brew "openconnect"
brew "packer"
brew "pandoc"
brew "php"
brew "pipenv"
brew "podman"
brew "postgresql@14"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "tcl-tk", link: false
brew "python@3.8"
brew "python@3.9"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "serverless"
brew "shellcheck"
brew "skaffold"
brew "sops"
brew "ssh-copy-id"
brew "stern"
brew "telnet"
brew "terraform", link: false
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tig"
brew "tree"
brew "vifm"
brew "virtualenv"
brew "wget"
brew "wimlib"
brew "yq"
brew "azure/kubelogin/kubelogin"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform-ls"
brew "jjuarez/tap-1/kubecolor"
brew "robscott/tap/kube-capacity"
brew "syncdk/yawsso/yawsso"
brew "tilt-dev/tap/tilt"
cask "alfred"
cask "atom", args: { appdir: "/Applications" }
cask "bruno"
cask "chromium"
cask "finch"
cask "headlamp"
cask "hidapitester"
cask "maccy"
cask "pgadmin4", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "powershell", args: { appdir: "/Applications" }
cask "session-manager-plugin"
cask "tunnelblick", args: { appdir: "/Applications" }
cask "utm"
cask "vagrant", args: { appdir: "/Applications" }
cask "visual-studio-code"
vscode "1000ch.svgo"
vscode "4ops.packer"
vscode "4ops.terraform"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antonkovalyov.soy"
vscode "danielthielking.aws-cloudformation-yaml"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "eamodio.gitlens"
vscode "eastman.vscode-cfn-nag"
vscode "erd0s.terraform-autocomplete"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hookyqr.beautify"
vscode "huntertran.auto-markdown-toc"
vscode "infracost.infracost"
vscode "jetmartin.bats"
vscode "jetpack-io.devbox"
vscode "johnpapa.vscode-peacock"
vscode "kddejong.vscode-cfn-lint"
vscode "kevinglasson.cornflakes-linter"
vscode "l13rary.l13-diff"
vscode "marcostazi.vs-code-vagrantfile"
vscode "maxird.jinja-fold"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pnp.polacode"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "run-at-scale.terraform-doc-snippets"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "sirtori.indenticator"
vscode "tbutterwith.bosun"
vscode "timonwong.shellcheck"
vscode "timvaneker.serverless-snippets"
vscode "tuxtina.json2yaml"
vscode "tyriar.sort-lines"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wholroyd.jinja"
mas "Calendars", id: 415181149
mas "DaisyDisk", id: 411643860
mas "Gifox", id: 1461845568
mas "WhatsApp", id: 1147396723